Revit 2027 API
BuiltInFailures.RoofFailures.UptoHeightTooLow Property
 Cutoff Level cannot be below bottom of roof.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UptoHeightTooLow { get; }
Public Shared ReadOnly Property UptoHeightTooLow As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UptoHeightTooLow {
	FailureDefinitionId^ get ();
}
static member UptoHeightTooLow : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoofFailures Class
Autodesk.Revit.DB Namespace